back/app/controllers/accounts_controller.rb

INSERT INTO `accounts` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('高橋工務店', 4, '2020-04-26 03:07:59.142924', '2020-04-26 03:07:59.142924')
INSERT INTO `accounting_periods` (`start`, `end`, `created_at`, `updated_at`) VALUES ('2020-01-01', '2020-12-31', '2020-04-26 03:18:25.808724', '2020-04-26 03:18:25.808724')
---
  def create
    new_account = Account.new(name: params[:account_name], user_id: @decoded_data[:user_id])
    if new_account.save
      new_accounting_period = AccountingPeriod.new(start: params[:account_period_start], end: params[:account_period_end])
      if new_accounting_period.save
        new_account.accounting_period_id = new_accounting_period.id
        if new_account.save

UPDATE `accounts` SET `accounts`.`accounting_period_id` = 3, `accounts`.`updated_at` = '2020-04-26 03:20:14.317421' WHERE `accounts`.`id` = 6
---
  def update
    account = Account.find(@current_account.id)
    account.name = params[:name]
    account.round_config = params[:round_config]
    if account.save