back/app/controllers/assets_controller.rb

SELECT `assets`.* FROM `assets`
---
  def index
    all_assets = Asset.all

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = NULL LIMIT 1
---
  def show
    asset = Asset.find(params[:id])