back/app/controllers/assets_controller.rb

SELECT `assets`.* FROM `assets`
INSERT INTO `assets` (`name`, `acquisition_date`, `acquisition_value`, `asset_item_id`, `depreciation_method_id`, `created_at`, `updated_at`) VALUES ('60inc テレビ', '2020-04-01', 300000, 334, 3, '2020-04-18 07:55:22.559136', '2020-04-18 07:55:22.559136')
---
  def list
    all_assets = Asset.all
    response = []
    all_assets.each do |asset|
      response.push({
        id: asset.id,
        name: asset.name,
        acquisition_date: asset.acquisition_date,
        acquisition_value: asset.acquisition_value,
        useful_life: asset.asset_item.useful_life.year,
        depreciation_method: asset.depreciation_method.display_name,
        created_at: asset.created_at.strftime("%Y-%m-%d"),
        updated_at: asset.updated_at.strftime("%Y-%m-%d")

INSERT INTO `assets` (`name`, `acquisition_date`, `acquisition_value`, `asset_item_id`, `depreciation_method_id`, `created_at`, `updated_at`) VALUES ('60インチ SONY テレビ', '2020-04-19', 300000, 334, 1, '2020-04-19 07:16:35.986211', '2020-04-19 07:16:35.986211')
---
  def create
    new_asset = Asset.new(
                  name: params[:name],
                  acquisition_date: params[:acquisitionDate],
                  acquisition_value: params[:acquisitionValue],
                  asset_item_id: params[:assetItemId],
                  depreciation_method_id: params[:depreciationMethodId]
                )

    if new_asset.save

SELECT `assets`.* FROM `assets` WHERE `assets`.`id` = 1 LIMIT 1
---
  def retrieve
    asset = Asset.find(params[:id])