back/app/controllers/login_controller.rb

  def login
    strong_params = login_params
    @user = User.find_by(email: strong_params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'keita@gmail.com' LIMIT 1

  def session
    validate_token
    @user_id = @decoded_data[:user_id]
    if User.find(@user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1