back/app/controllers/masters_controller.rb

SELECT COUNT(*) FROM `asset_items` WHERE (item LIKE '%%')
---
  def asset_item_count
    items_count = AssetItem.all.count

SELECT `asset_items`.* FROM `asset_items` WHERE (item LIKE '%%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `asset_items` WHERE (item LIKE '%%')
SELECT COUNT(*) FROM `asset_items` WHERE (item LIKE '%こう%')
---
  def asset_item
    puts params
    pagenated_items = AssetItem.where('item LIKE ?', "%#{params[:q]}%").page(params[:page]).per(params[:per])
    total_pages = pagenated_items.total_pages
    response = []
    pagenated_items.each do |item|

SELECT `depreciation_methods`.* FROM `depreciation_methods`
---
  def dep_method
    all_methods = DepreciationMethod.all