back/app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `role_id`, `created_at`, `updated_at`) VALUES ('keitahighbridge@gmail.com', '$2a$12$dTJuWauE0YpV5I8lRHloluLdVhUjWFQQVCg5.4xaQCVZMKTO9NZy.', 1, '2020-04-26 00:23:30.421717', '2020-04-26 00:23:30.421717')
---
  def create
    new_user = User.new(
      email: params[:email],
      password_digest: params[:password],
      name: params[:name],
      role_id: params[:role_id],
      account_id: params[:account_id]
    )
    if new_user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def show
    user = User.find(params[:id])